import React from "react";

const FQA = () => {
  return (
    <section className="FQA container ">
      <h3 className=" text-primary"> الاسئلة الشائعة:</h3>

      <ol className="fs-5">
        <li >
          كيف يمكنني تقديم شكوى على المنصة؟
          <p>
            يمكنك تقديم شكوى من خلال الدخول إلى صفحة "تقديم شكوى"، ثم ملء
            البيانات المطلوبة، مثل نوع المشكلة والوصف، ثم الضغط على زر "إرسال".
          </p>
        </li>
        <li>
          كيف يمكنني متابعة حالة الشكوى الخاصة بي؟
          <p>
            بعد تقديم الشكوى، يمكنك متابعة حالتها من خلال صفحة "شكاوي"، حيث
            ستظهر لك الحالة الحالية للشكوى (تم الإرسال، قيد الحل، تم حلها).
          </p>
        </li>
        <li>
          كم يستغرق حل الشكوى؟
          <p>
            يختلف وقت الحل حسب نوع المشكلة. يتم التعامل مع الشكاوى التقنية
            والإدارية في أقرب وقت ممكن، ويمكنك متابعة حالتها من خلال المنصة.
          </p>
        </li>
        <li>
          ماذا أفعل إذا لم يتم حل مشكلتي بعد فترة طويلة؟
          <p>
            يمكنك إعادة التواصل مع الدعم الفني عبر صفحة "التواصل مع الدعم" لطلب
            تحديث بخصوص الشكوى الخاصة بك.
          </p>
        </li>
        <li>
          هل يمكنني تعديل الشكوى بعد إرسالها؟
          <p>
            لا يمكن تعديل الشكوى بعد إرسالها، ولكن يمكنك تقديم شكوى جديدة مع
            الإشارة إلى رقم الشكوى السابقة.
          </p>
        </li>
        <li>
          ما هي أنواع الشكاوى التي يمكنني تقديمها؟
          <p>
           
            يمكنك تقديم شكاوى متعلقة بالمشاكل التقنية (مثل تسجيل الدخول، مشاكل
            في المنصة)، المشاكل الأكاديمية (مثل المحتوى التعليمي)، أو الشكاوى
            الإدارية (مثل التأخير في استخراج الشهادات).
          </p>
        </li>
      </ol>
    </section>
  );
};

export default FQA;
